# 属相名称
TRUNKS = '甲乙丙丁戊己庚辛任癸'
BOUGHS = '子丑寅卯辰巳午未申酉戌亥'
ZODIAC = '鼠牛虎兔龙蛇马羊猴鸡狗猪'

# 农历日期名
LUNAR_DAY = ("",
    "初一", "初二", "初三", "初四", "初五",
    "初六", "初七", "初八", "初九", "初十",
    "十一", "十二", "十三", "十四", "十五",
    "十六", "十七", "十八", "十九", "二十",
    "廿一", "廿二", "廿三", "廿四", "廿五",
    "廿六", "廿七", "廿八", "廿九", "三十",
)

# 农历月份名
LUNAR_MON = '-正二三四五六七八九十冬腊'

# 月干支
MOON_ERA = (
    # 甲己    乙庚    丙辛    丁壬    戊癸
    ("丙寅", "戊寅", "庚寅", "壬寅", "甲寅"),
    ("丁卯", "己卯", "辛卯", "癸卯", "乙卯"),
    ("戊辰", "庚辰", "壬辰", "甲辰", "丙辰"),
    ("己巳", "辛巳", "癸巳", "乙巳", "丁巳"),
    ("庚午", "壬午", "甲午", "丙午", "戊午"),
    ("辛未", "癸未", "乙未", "丁未", "己未"),
    ("壬申", "甲申", "丙申", "戊申", "庚申"),
    ("癸酉", "乙酉", "丁酉", "己酉", "辛酉"),
    ("甲戌", "丙戌", "戊戌", "庚戌", "壬戌"),
    ("乙亥", "丁亥", "己亥", "辛亥", "癸亥"),
    ("丙子", "戊子", "庚子", "壬子", "甲子"),
    ("丁丑", "己丑", "辛丑", "癸丑", "乙丑"),
)

# 时辰干支
TIME_ERA = (
    # 甲己    乙庚    丙辛    丁壬    戊癸
    ("甲子", "丙子", "戊子", "庚子", "壬子"),
    ("乙丑", "丁丑", "己丑", "辛丑", "癸丑"),
    ("丙寅", "戊寅", "庚寅", "壬寅", "甲寅"),
    ("丁卯", "己卯", "辛卯", "癸卯", "乙卯"),
    ("戊辰", "庚辰", "壬辰", "甲辰", "丙辰"),
    ("己巳", "辛巳", "癸巳", "乙巳", "丁巳"),
    ("庚午", "壬午", "甲午", "丙午", "戊午"),
    ("辛未", "癸未", "乙未", "丁未", "己未"),
    ("壬申", "甲申", "丙申", "戊申", "庚申"),
    ("癸酉", "乙酉", "丁酉", "己酉", "辛酉"),
    ("甲戌", "丙戌", "戊戌", "庚戌", "壬戌"),
    ("乙亥", "丁亥", "己亥", "辛亥", "癸亥"),
)
